s = input()
s = s.replace('1', 'one')

s2 = input()
s2 = s2.replace('@', '')

print(s)
print(s2)



## Задание 9. Замена подстроки. Дана строка. Замените в этой строке все
## цифры 1 на слово one.
## Дана строка. Удалите из этой строки все символы @.