a = int(input())
n = int(input())

r = pow(a, n)

print('Результат функции: ', r)



## Задание 2 Отрицательная степень. Дано действительное положительное
## число и целоe число .
## Вычислите . Решение оформите в виде функции power(a, n).
## Стандартной функцией возведения в степень пользоваться нельзя.